"""
https://blog.csdn.net/qq_38923792/article/details/102833601
终端的字符颜色是用转义序列控制的，是文本模式下的系统显示功能，和具体的语言无关。控制字符颜色的转义序列是以ESC开头,即用\033来完成
————————————————
开头部分: \033[显示方式;前景色;背景色m
结尾部分: \033[0m
————————————————
显示方式: 0（默认值）、1（高亮）、22（非粗体）、4（下划线）、24（非下划线）、 5（闪烁）、25（非闪烁）、7（反显）、27（非反显）
前景色: 30（黑色）、31（红色）、32（绿色）、 33（黄色）、34（蓝色）、35（紫色）、36（青色）、37（白色）
背景色: 40（黑色）、41（红色）、42（绿色）、 43（黄色）、44（蓝色）、45（紫色）、46（青色）、47（白色）
"""

def log_red(msg):
    print('\033[1;31;40m%s\033[0m' % msg)
def log_green(msg):
    print('\033[1;32;40m%s\033[0m' % msg)
def log_yellow(msg):
    print('\033[1;33;40m%s\033[0m' % msg)
def log_blue(msg):
    print('\033[1;34;40m%s\033[0m' % msg)
def log_pink(msg):
    print('\033[1;35;40m%s\033[0m' % msg)
def log_cyan(msg):
    print('\033[1;36;40m%s\033[0m' % msg)
def log_white(msg):
    print('\033[1;37;40m%s\033[0m' % msg)

